src/OpenFoam/Airfoil_simulation_1/OpenFOAM_2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    front
    {
        type            empty;
        physicalType    patch;
        nFaces          42404;
        startFace       63302;
    }
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          42404;
        startFace       105706;
    }
    exit
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       148110;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       148160;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       148210;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       148260;
    }
    aerofoil
    {
        type            wall;
        physicalType    patch;
        nFaces          408;
        startFace       148310;
    }
)

// ************************************************************************* //
